Importing all the required libraries

In [2]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from keras.models import Sequential
from keras.layers import Dense, Dropout, LSTM
import matplotlib.pyplot as plt

Read Stock Data

In [3]:
url = 'https://raw.githubusercontent.com/cybertraining-dsc/fa20-523-313/main/JKSEnew.csv'
df = pd.read_csv(url)

df.head()

        Date        Open        High  ...       Close   Adj Close    Volume
0   1/4/2000  677.473999  704.031982  ...  700.218018  700.197266  11053800
1   1/5/2000  694.859009  694.859009  ...  678.086975  678.066895   8685000
2   1/6/2000  681.297974  691.887024  ...  688.520996  688.500549   7604500
3  1/11/2000  691.924011  704.541992  ...  696.002991  695.982361  17793800
4  1/12/2000  696.293030  698.145020  ...  690.164001  690.143494  14668700

[5 rows x 7 columns]

Overview of the tail of data

In [4]:
df.tail()

            Date         Open         High  ...        Close    Adj Close     Volume
5077  11/11/2020  5475.564941  5520.908203  ...  5509.513184  5509.513184  165238700
5078  11/12/2020  5494.484863  5500.416016  ...  5458.602051  5458.602051  119777900
5079  11/13/2020  5449.101074  5466.563965  ...  5461.058105  5461.058105  113428800
5080  11/16/2020  5500.034180  5519.679199  ...  5494.872070  5494.872070  119907500
5081  11/17/2020  5516.580078  5562.537109  ...  5529.939941  5529.939941  146811400

[5 rows x 7 columns]

Analyze if there is null or missing values in dataset

In [5]:
df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [6]:
df['Date'] = pd.to_datetime(df.Date,format='%m/%d/%Y')
df.index = df['Date']

data = df.sort_index(ascending=True, axis=0)

                     Date    Close
5077  2020-11-11 00:00:00  5509.51
5078  2020-11-12 00:00:00   5458.6
5079  2020-11-13 00:00:00  5461.06
5080  2020-11-16 00:00:00  5494.87
5081  2020-11-17 00:00:00  5529.94

Calculate the percentage of price changes, and store it in new_data

In [7]:
new_data = pd.DataFrame(index=range(0,len(df)),columns=['Date', 'Close'])

for i in range(0,len(data)):
    new_data['Date'][i] = data['Date'][i]
    new_data['Close'][i] = data['Close'][i]

baseValue = new_data['Close'][0]
new_data['Close'][0] = 0
for i in range(1,len(new_data['Close'])):
  pChange = ((float(new_data['Close'][i])-baseValue) / abs(baseValue)) *100.00
  #percentageChange(baseValue,[i])
  baseValue = new_data['Close'][i]
  new_data['Close'][i] = pChange
new_data.head()

                  Date     Close
0  2000-01-04 00:00:00         0
1  2000-01-05 00:00:00  -3.16059
2  2000-01-06 00:00:00   1.53874
3  2000-01-11 00:00:00   1.08668
4  2000-01-12 00:00:00 -0.838932

In [9]:
new_data.index = new_data['Date']
new_data.drop('Date', axis=1, inplace=True)
new_data.head()

               Close
Date
2000-01-04         0
2000-01-05  -3.16059
2000-01-06   1.53874
2000-01-11   1.08668
2000-01-12 -0.838932

In [12]:
dataset = new_data.values
train, test = train_test_split(dataset, train_size=0.80, test_size = 0.20, shuffle = False)
print(train[0:5])

[[0]
 [-3.1605931911337746]
 [1.538743757760561]
 [1.0866763749351367]
 [-0.8389317395907685]]